simmsb/tyrfing/vendor/avr-device/svd/attiny404.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRCSCAN</name>
      <description>CRCSCAN</description>
      <baseAddress>0x00000120</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable CRC scan</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NMIEN</name>
              <description>Enable NMI Trigger</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Reset CRC scan</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRC</name>
              <description>CRC Source</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH</name>
                  <description>CRC on entire flash</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APPLICATION</name>
                  <description>CRC on boot and appl section of flash</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT</name>
                  <description>CRC on boot section of flash</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>CRC Flash Access Mode</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRIORITY</name>
                  <description>Priority to flash</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>CRC Busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OK</name>
              <description>CRC Ok</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EVSYS</name>
      <description>Event System</description>
      <baseAddress>0x00000180</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x12</offset>
        <size>0xB</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x22</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ASYNCCH0</name>
          <description>Asynchronous Channel 0 Generator Selection</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCCH0</name>
              <description>Asynchronous Channel 0 Generator Selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBCLR</name>
                  <description>Timer/Counter D0 compare B clear</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPASET</name>
                  <description>Timer/Counter D0 compare A set</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBSET</name>
                  <description>Timer/Counter D0 compare B set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_PROGEV</name>
                  <description>Timer/Counter D0 program event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN0</name>
                  <description>Asynchronous Event from Pin PA0</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN1</name>
                  <description>Asynchronous Event from Pin PA1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN2</name>
                  <description>Asynchronous Event from Pin PA2</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN3</name>
                  <description>Asynchronous Event from Pin PA3</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN4</name>
                  <description>Asynchronous Event from Pin PA4</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN5</name>
                  <description>Asynchronous Event from Pin PA5</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN6</name>
                  <description>Asynchronous Event from Pin PA6</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN7</name>
                  <description>Asynchronous Event from Pin PA7</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI</name>
                  <description>Unified Program and debug interface</description>
                  <value>18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCCH1</name>
          <description>Asynchronous Channel 1 Generator Selection</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCCH1</name>
              <description>Asynchronous Channel 1 Generator Selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable custom logic LUT0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable custom logic LUT1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBCLR</name>
                  <description>Timer/Counter D0 compare B clear</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPASET</name>
                  <description>Timer/Counter D0 compare A set</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBSET</name>
                  <description>Timer/Counter D0 compare B set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_PROGEV</name>
                  <description>Timer/Counter D0 program event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN0</name>
                  <description>Asynchronous Event from Pin PB0</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN1</name>
                  <description>Asynchronous Event from Pin PB1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN2</name>
                  <description>Asynchronous Event from Pin PB2</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN3</name>
                  <description>Asynchronous Event from Pin PB3</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN4</name>
                  <description>Asynchronous Event from Pin PB4</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN5</name>
                  <description>Asynchronous Event from Pin PB5</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN6</name>
                  <description>Asynchronous Event from Pin PB6</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN7</name>
                  <description>Asynchronous Event from Pin PB7</description>
                  <value>17</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCSTROBE</name>
          <description>Asynchronous Channel Strobe</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>write-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ASYNCUSER0</name>
          <description>Asynchronous User Ch 0 Input Selection - TCB0</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER0</name>
              <description>Asynchronous User Ch 0 Input Selection - TCB0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER1</name>
          <description>Asynchronous User Ch 1 Input Selection - ADC0</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER1</name>
              <description>Asynchronous User Ch 1 Input Selection - ADC0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER10</name>
          <description>Asynchronous User Ch 10 Input Selection - Event Out 2</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER10</name>
              <description>Asynchronous User Ch 10 Input Selection - Event Out 2</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER2</name>
          <description>Asynchronous User Ch 2 Input Selection - CCL LUT0 Event 0</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER2</name>
              <description>Asynchronous User Ch 2 Input Selection - CCL LUT0 Event 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
